<!DOCTYPE HTML>
<html lang="zh-hans" >
    <!-- Start book Python基础 -->
<!-- Start book Python基础 -->
    <head>
        <!-- head:start -->
<!-- head:start -->
        <meta charset="UTF-8">
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <title>多任务 | Python基础</title>
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <meta name="description" content="Python基础">
        <meta name="generator" content="GitBook 2.6.7">
        <meta name="author" content="姜伟">
        
        <meta name="HandheldFriendly" content="true"/>
        <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
        <meta name="apple-mobile-web-app-capable" content="yes">
        <meta name="apple-mobile-web-app-status-bar-style" content="black">
        <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
        <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">
        
    <link rel="stylesheet" href="gitbook/style.css">
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-prism/prism.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-splitter/splitter.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-toggle-chapters/toggle.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-highlight/website.css">
        
    
        
        <link rel="stylesheet" href="gitbook/plugins/gitbook-plugin-fontsettings/website.css">
        
    
    

        
    
    
    <link rel="next" href="./index.html" />
    
    

        <!-- head:end -->
<!-- head:end -->
    </head>
    <body>
        <!-- body:start -->
<!-- body:start -->
        
    <div class="book"
        data-level="0"
        data-chapter-title="多任务"
        data-filepath="chapter01.md"
        data-basepath="."
        data-revision="Tue Mar 03 2020 22:20:29 GMT+0800 (中国标准时间)"
        data-innerlanguage="">
    

<div class="book-summary">
    <nav role="navigation">
        <ul class="summary">
            
            
            
            

            

            
    
        <li class="chapter active" data-level="0" data-path="chapter01.html">
            
                
                    <a href="./chapter01.html">
                
                        <i class="fa fa-check"></i>
                        
                        多任务
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1" data-path="index.html">
            
                
                    <a href="./index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.</b>
                        
                        线程
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1" data-path="chapter01/section01.html">
            
                
                    <a href="./chapter01/section01.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.1.</b>
                        
                        线程安全问题
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter01/section02.html">
            
                
                    <a href="./chapter01/section02.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.2.</b>
                        
                        线程锁
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter01/section03.html">
            
                
                    <a href="./chapter01/section03.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.3.</b>
                        
                        线程间通信
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter01/section04.html">
            
                
                    <a href="./chapter01/section04.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>1.4.</b>
                        
                        多线程版聊天
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2" data-path="chapter02/index.html">
            
                
                    <a href="./chapter02/index.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.</b>
                        
                        进程
                    </a>
            
            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1" data-path="chapter02/section01.html">
            
                
                    <a href="./chapter02/section01.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.1.</b>
                        
                        创建进程
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="chapter02/section02.html">
            
                
                    <a href="./chapter02/section02.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.2.</b>
                        
                        进程和线程的区别
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="chapter02/section03.html">
            
                
                    <a href="./chapter02/section03.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.3.</b>
                        
                        进程间通信
                    </a>
            
            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="chapter02/section04.html">
            
                
                    <a href="./chapter02/section04.html">
                
                        <i class="fa fa-check"></i>
                        
                            <b>2.4.</b>
                        
                        进程池
                    </a>
            
            
        </li>
    

            </ul>
            
        </li>
    


            
            <li class="divider"></li>
            <li>
                <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
                    本书使用 GitBook 发布
                </a>
            </li>
            
        </ul>
    </nav>
</div>

    <div class="book-body">
        <div class="body-inner">
            <div class="book-header" role="navigation">
    <!-- Actions Left -->
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="./" >Python基础</a>
    </h1>
</div>

            <div class="page-wrapper" tabindex="-1" role="main">
                <div class="page-inner">
                
                
                    <section class="normal" id="section-">
                    
                        <h2 id="&#x591A;&#x4EFB;&#x52A1;&#x4ECB;&#x7ECD;">&#x591A;&#x4EFB;&#x52A1;&#x4ECB;&#x7ECD;</h2>
<p>&#x5728;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x7684;&#x573A;&#x666F;&#x4E2D;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x8DF3;&#x821E;&#x548C;&#x5531;&#x6B4C;&#x662F;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x7684;&#x3002;</p>
<p>&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x6765;&#x6A21;&#x62DF;&#x5531;&#x6B4C;&#x548C;&#x8DF3;&#x821E;&#x7684;&#x529F;&#x80FD;&#xFF1A;</p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> time <span class="hljs-keyword">import</span> sleep

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">sing</span><span class="hljs-params">()</span>:</span>
    <span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> range(<span class="hljs-number">3</span>):
        print(<span class="hljs-string">&quot;&#x6B63;&#x5728;&#x5531;&#x6B4C;...%d&quot;</span>%i)
        sleep(<span class="hljs-number">1</span>)

<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">dance</span><span class="hljs-params">()</span>:</span>
    <span class="hljs-keyword">for</span> i <span class="hljs-keyword">in</span> range(<span class="hljs-number">3</span>):
        print(<span class="hljs-string">&quot;&#x6B63;&#x5728;&#x8DF3;&#x821E;...%d&quot;</span>%i)
        sleep(<span class="hljs-number">1</span>)

<span class="hljs-keyword">if</span> __name__ == <span class="hljs-string">&apos;__main__&apos;</span>:
    sing() <span class="hljs-comment">#&#x5531;&#x6B4C;</span>
    dance() <span class="hljs-comment">#&#x8DF3;&#x821E;</span>
</code></pre>
<ul>
<li>&#x5F88;&#x663E;&#x7136;&#x521A;&#x521A;&#x7684;&#x7A0B;&#x5E8F;&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x6210;&#x5531;&#x6B4C;&#x548C;&#x8DF3;&#x821E;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x7684;&#x8981;&#x6C42;</li>
<li>&#x5982;&#x679C;&#x60F3;&#x8981;&#x5B9E;&#x73B0;&#x201C;&#x5531;&#x6B4C;&#x8DF3;&#x821E;&#x201D;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EB;&#x505A;&#xFF1A;<strong>&#x591A;&#x4EFB;&#x52A1;</strong></li>
</ul>
<h2 id="&#x591A;&#x4EFB;&#x52A1;&#x6982;&#x5FF5;">&#x591A;&#x4EFB;&#x52A1;&#x6982;&#x5FF5;</h2>
<p>&#x4EC0;&#x4E48;&#x53EB;&#x201C;&#x591A;&#x4EFB;&#x52A1;&#x201D;&#x5462;&#xFF1F;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF0C;&#x4F60;&#x4E00;&#x8FB9;&#x5728;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#x7F51;&#xFF0C;&#x4E00;&#x8FB9;&#x5728;&#x542C;MP3&#xFF0C;&#x4E00;&#x8FB9;&#x5728;&#x7528;Word&#x8D76;&#x4F5C;&#x4E1A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x591A;&#x4EFB;&#x52A1;&#xFF0C;&#x81F3;&#x5C11;&#x540C;&#x65F6;&#x6709;3&#x4E2A;&#x4EFB;&#x52A1;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x3002;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4EFB;&#x52A1;&#x6084;&#x6084;&#x5730;&#x5728;&#x540E;&#x53F0;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7740;&#xFF0C;&#x53EA;&#x662F;&#x684C;&#x9762;&#x4E0A;&#x6CA1;&#x6709;&#x663E;&#x793A;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x591A;&#x6838;CPU&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x666E;&#x53CA;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x8FC7;&#x53BB;&#x7684;&#x5355;&#x6838;CPU&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x591A;&#x4EFB;&#x52A1;&#x3002;&#x7531;&#x4E8E;CPU&#x6267;&#x884C;&#x4EE3;&#x7801;&#x90FD;&#x662F;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x5355;&#x6838;CPU&#x662F;&#x600E;&#x4E48;&#x6267;&#x884C;&#x591A;&#x4EFB;&#x52A1;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x7B54;&#x6848;&#x5C31;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8F6E;&#x6D41;&#x8BA9;&#x5404;&#x4E2A;&#x4EFB;&#x52A1;&#x4EA4;&#x66FF;&#x6267;&#x884C;&#xFF0C;&#x4EFB;&#x52A1;1&#x6267;&#x884C;0.01&#x79D2;&#xFF0C;&#x5207;&#x6362;&#x5230;&#x4EFB;&#x52A1;2&#xFF0C;&#x4EFB;&#x52A1;2&#x6267;&#x884C;0.01&#x79D2;&#xFF0C;&#x518D;&#x5207;&#x6362;&#x5230;&#x4EFB;&#x52A1;3&#xFF0C;&#x6267;&#x884C;0.01&#x79D2;&#x2026;&#x2026;&#x8FD9;&#x6837;&#x53CD;&#x590D;&#x6267;&#x884C;&#x4E0B;&#x53BB;&#x3002;&#x8868;&#x9762;&#x4E0A;&#x770B;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x90FD;&#x662F;&#x4EA4;&#x66FF;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;CPU&#x7684;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x5FEB;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x611F;&#x89C9;&#x5C31;&#x50CF;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x5728;&#x540C;&#x65F6;&#x6267;&#x884C;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x771F;&#x6B63;&#x7684;&#x5E76;&#x884C;&#x6267;&#x884C;&#x591A;&#x4EFB;&#x52A1;&#x53EA;&#x80FD;&#x5728;&#x591A;&#x6838;CPU&#x4E0A;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x4EFB;&#x52A1;&#x6570;&#x91CF;&#x8FDC;&#x8FDC;&#x591A;&#x4E8E;CPU&#x7684;&#x6838;&#x5FC3;&#x6570;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E5F;&#x4F1A;&#x81EA;&#x52A8;&#x628A;&#x5F88;&#x591A;&#x4EFB;&#x52A1;&#x8F6E;&#x6D41;&#x8C03;&#x5EA6;&#x5230;&#x6BCF;&#x4E2A;&#x6838;&#x5FC3;&#x4E0A;&#x6267;&#x884C;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF08;Process&#xFF09;&#xFF0C;&#x6BD4;&#x5982;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x662F;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x8FDB;&#x7A0B;&#xFF0C;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x8BB0;&#x4E8B;&#x672C;&#x5C31;&#x542F;&#x52A8;&#x4E86;&#x4E00;&#x4E2A;&#x8BB0;&#x4E8B;&#x672C;&#x8FDB;&#x7A0B;&#xFF0C;&#x6253;&#x5F00;&#x4E24;&#x4E2A;&#x8BB0;&#x4E8B;&#x672C;&#x5C31;&#x542F;&#x52A8;&#x4E86;&#x4E24;&#x4E2A;&#x8BB0;&#x4E8B;&#x672C;&#x8FDB;&#x7A0B;&#xFF0C;&#x6253;&#x5F00;&#x4E00;&#x4E2A;Word&#x5C31;&#x542F;&#x52A8;&#x4E86;&#x4E00;&#x4E2A;Word&#x8FDB;&#x7A0B;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x8FDB;&#x7A0B;&#x8FD8;&#x4E0D;&#x6B62;&#x540C;&#x65F6;&#x5E72;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x6BD4;&#x5982;Word&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x6253;&#x5B57;&#x3001;&#x62FC;&#x5199;&#x68C0;&#x67E5;&#x3001;&#x6253;&#x5370;&#x7B49;&#x4E8B;&#x60C5;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5185;&#x90E8;&#xFF0C;&#x8981;&#x540C;&#x65F6;&#x5E72;&#x591A;&#x4EF6;&#x4E8B;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x201C;&#x5B50;&#x4EFB;&#x52A1;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8FDB;&#x7A0B;&#x5185;&#x7684;&#x8FD9;&#x4E9B;&#x201C;&#x5B50;&#x4EFB;&#x52A1;&#x201D;&#x79F0;&#x4E3A;&#x7EBF;&#x7A0B;&#xFF08;Thread&#xFF09;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x81F3;&#x5C11;&#x8981;&#x5E72;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x50CF;Word&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x7684;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x6267;&#x884C;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x65B9;&#x5F0F;&#x548C;&#x591A;&#x8FDB;&#x7A0B;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5728;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x5FEB;&#x901F;&#x5207;&#x6362;&#xFF0C;&#x8BA9;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x77ED;&#x6682;&#x5730;&#x4EA4;&#x66FF;&#x8FD0;&#x884C;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x540C;&#x65F6;&#x6267;&#x884C;&#x4E00;&#x6837;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x771F;&#x6B63;&#x5730;&#x540C;&#x65F6;&#x6267;&#x884C;&#x591A;&#x7EBF;&#x7A0B;&#x9700;&#x8981;&#x591A;&#x6838;CPU&#x624D;&#x53EF;&#x80FD;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x524D;&#x9762;&#x7F16;&#x5199;&#x7684;&#x6240;&#x6709;&#x7684;Python&#x7A0B;&#x5E8F;&#xFF0C;&#x90FD;&#x662F;&#x6267;&#x884C;&#x5355;&#x4EFB;&#x52A1;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8981;&#x540C;&#x65F6;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x600E;&#x4E48;&#x529E;&#xFF1F;</p>
<p>&#x6709;&#x4E24;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;</p>
<p>&#x4E00;&#x79CD;&#x662F;&#x542F;&#x52A8;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x867D;&#x7136;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F46;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x4E00;&#x5757;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5185;&#x542F;&#x52A8;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E5F;&#x53EF;&#x4EE5;&#x4E00;&#x5757;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x7B2C;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x542F;&#x52A8;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x518D;&#x542F;&#x52A8;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD9;&#x6837;&#x540C;&#x65F6;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x5C31;&#x66F4;&#x591A;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x79CD;&#x6A21;&#x578B;&#x66F4;&#x590D;&#x6742;&#xFF0C;&#x5B9E;&#x9645;&#x5F88;&#x5C11;&#x91C7;&#x7528;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x5C31;&#x662F;&#xFF0C;&#x591A;&#x4EFB;&#x52A1;&#x7684;&#x5B9E;&#x73B0;&#x6709;3&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x591A;&#x8FDB;&#x7A0B;&#x6A21;&#x5F0F;&#xFF1B;</li>
<li>&#x591A;&#x7EBF;&#x7A0B;&#x6A21;&#x5F0F;&#xFF1B;</li>
<li>&#x591A;&#x8FDB;&#x7A0B;+&#x591A;&#x7EBF;&#x7A0B;&#x6A21;&#x5F0F;&#x3002;</li>
</ul>
<h4 id="&#x6CE8;&#x610F;&#xFF1A;">&#x6CE8;&#x610F;&#xFF1A;</h4>
<ul>
<li>&#x5E76;&#x53D1;&#xFF1A;&#x6307;&#x7684;&#x662F;&#x4EFB;&#x52A1;&#x6570;&#x591A;&#x4F59;cpu&#x6838;&#x6570;&#xFF0C;&#x901A;&#x8FC7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5404;&#x79CD;&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#x7B97;&#x6CD5;&#xFF0C;&#x5B9E;&#x73B0;&#x7528;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x201C;&#x4E00;&#x8D77;&#x201D;&#x6267;&#x884C;&#xFF08;&#x5B9E;&#x9645;&#x4E0A;&#x603B;&#x6709;&#x4E00;&#x4E9B;&#x4EFB;&#x52A1;&#x4E0D;&#x5728;&#x6267;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x5207;&#x6362;&#x4EFB;&#x52A1;&#x7684;&#x901F;&#x5EA6;&#x76F8;&#x5F53;&#x5FEB;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x4E00;&#x8D77;&#x6267;&#x884C;&#x800C;&#x5DF2;&#xFF09;</li>
<li>&#x5E76;&#x884C;&#xFF1A;&#x6307;&#x7684;&#x662F;&#x4EFB;&#x52A1;&#x6570;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;cpu&#x6838;&#x6570;&#xFF0C;&#x5373;&#x4EFB;&#x52A1;&#x771F;&#x7684;&#x662F;&#x4E00;&#x8D77;&#x6267;&#x884C;&#x7684;&#x3002;</li>
</ul>

                    
                    </section>
                
                
                </div>
            </div>
        </div>

        
        
        <a href="./index.html" class="navigation navigation-next navigation-unique" aria-label="Next page: 线程"><i class="fa fa-angle-right"></i></a>
        
    </div>
</div>

        
<script src="gitbook/app.js"></script>

    
    <script src="gitbook/plugins/gitbook-plugin-splitter/splitter.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-copy-code-button/toggle.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-toggle-chapters/toggle.js"></script>
    

    
    <script src="gitbook/plugins/gitbook-plugin-fontsettings/buttons.js"></script>
    

<script>
require(["gitbook"], function(gitbook) {
    var config = {"prism":{},"splitter":{},"copy-code-button":{},"toggle-chapters":{},"highlight":{},"fontsettings":{"theme":"white","family":"sans","size":2}};
    gitbook.start(config);
});
</script>

        <!-- body:end -->
<!-- body:end -->
    </body>
    <!-- End of book Python基础 -->
<!-- End of book Python基础 -->
</html>
